# """实战 1： 求 1~10 之间所有整数的乘积"""
# num = 1
# result = 1
# while num <= 10:
#     result *= num
#     num += 1
# print("1~10之间的乘积为：",result)

#
# """实战 2： 输入密码，直到密码输入正确，输出 登录成功。"""
# password = 'hogwarts'
# input_password = ""
# # print(input_password)
#
# while password != input_password:
#     input_password = input('请输入密码：')
# print("密码输入正确！！登陆成功")

# """
# # 实战 3： 在行酒令中，有一个数 7 小游戏，游戏参与者依次报数，
# # 但需要跳过所有包含 7 或 7 的整数倍的数字，
# # 编写程序找出 1~100 范围内所有符合该条件的数字，方便在游戏中跳过。
# # """
# num = 1
# while  num <= 100:
#     if num % 7 == 0:
#         print(f'当前跳过的数字为:{num}')
#     else:
#         print("当前数字为：", num)
#
#     num += 1



"""
课堂练习
编写一个 Python 程序，输入一个整数，计算该整数的二进制表示形式
二进制与十进制的转换
10进制：0 1  2    3   4
2进制：0  1  10  11   100
10进制除以2后的余数就是二进制对应的数字

11/2 = 5 1
5/2 = 2 1
2/2 = 1 0
1/2 = 0 1
1011

"""
# num = int()
# s = num // 2
# ys = num % 2
#
# num = input("请输入一个整数：")
#
# # 余数不为0
# while s != 0:
#     s = num // 2

"""
列表中保存若干个数字，计算数字的和，最小值，最大值，平均数
# 要统计的列表
data = [
    23456, 234, 23, 423, 423, 
    423, 423, 412, 3235, 346, 
    47, 5687, 678, 7, 453623, 
    4523, 565, 786, 9789, 567, 
    34634, 234
]

"""

#
# data = [
#     23456, 234, 23, 423, 423,
#     423, 423, 412, 3235, 346,
#     47, 5687, 678, 7, 453623,
#     4523, 565, 786, 9789, 567,
#     34634, 234]

# # 数字的和
# n = 23456
# sum = int()
# for n in data:
#     sum += n
#
# print("数字的和为：",sum)
#
#
# # 最小值
# data.sort()
# print('最小值为：',data[0])
#
# # 最大值
# data.sort(reverse=True)
# print('最大值为：',data[0])
#
# # 平均数
# # 统计数字个数
# num = len(data)
# avg = sum /num
# print("平均值为：",avg)

'''
实战：词频统计
编写一个 Python 程序，来计算给定文本中每个单词出现的次数。
'''




